Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: <!ELEMENT P (#PCDATA)> Una de les aplicacions més importants de les DTD és que serveixen per a la validació automàtica dels documents: un programa validador llegeix la DTD i el document XML i decideix si és vàlid, és a dir, si segueix l'especificació donada en la DTD, però les DTD poden servir també per a construir programes que processen o transformen els documents XML, com ara quan es vol produir una presentació visual del document (o de determinades estructures del document).
es_es: <!ELEMENT P (#PCDATA)> Una de las aplicaciones más importantes de las DTD es que sirven para la validación automática de los documentos: un programa validador lee la DTD y el documento XML y decide si es válido, es decir, si sigue la especificación dada en la DTD. Pero las DTD pueden servir también para construir programas que procesan o transforman los documentos XML, como por ejemplo cuando se quiere producir una presentación visual del documento (o de determinadas estructuras del documento).

source: Si volguérem que el text estiguera compost per zero o més paràgrafs usaríem ``*'' en comptes de ``+''.
es_es: Si quisiéramos que el texto estuviera compuesto por cero o más párrafos usaríamos ``*'' en vez de ``+''.

source: Però la majoria dels processadors de textos wysiwyg actuals permeten un cert nivell de codificació de l'estructura, a través dels anomenats estils: hi ha estils de paràgraf (paràgraf del cos de text, encapçalaments de diversos nivells, etc.) i estils de caràcter (definicions, èmfasi, èmfasi forta, text d'ordinador, etc.). A cada estil se li assignen unes determinades característiques de presentació: per exemple, els encapçalaments de nivell 2 van en Helvetica de 14 punts negreta i numerats automàticament amb el número de la secció de nivell 1, un punt i el número de la secció de nivell 2; les definicions van en negreta i l'èmfasi en cursiva, etc.
es_es: Pero la mayoría de los procesadores de textos wysiwyg actuales permiten un cierto nivel de codificación de la estructura, a través de los llamados estilos: hay estilos de párrafo (párrafo del cuerpo de texto, encabezamientos de varios niveles, etc.) y estilos de carácter (definiciones, énfasis, énfasis fuerte, texto de ordenador, etc.). A cada estilo se le asignan unas determinadas características de presentación: por ejemplo, los encabezamientos de nivel 2 van en Helvetica de 14 puntos negrita y numerados automáticamente con el número de la sección de nivel 1, un punto y el número de la sección de nivel 2; las definiciones van en negrita y el énfasis en cursiva, etc.

source: Alguns programes permeten buscar usant les anomenades expressions regulars, clàssiques en el sistema operatiu Unix, les quals permeten, mitjançant caràcters especials anomenats jòquers (anglés wildcards), buscar tots els mots que segueixen un patró determinat.
es_es: Algunos programas permiten buscar usando las llamadas expresiones regulares, clásicas en el sistema operativo Unix, las cuales permiten, mediante caracteres especiales llamados comodines (inglés wildcards), buscar todas las palabras que siguen un patrón determinado.

source: Un element no pot tenir dos atributs amb el mateix nom.
es_es: Un elemento no puede tener dos atributos con el mismo nombre.

source: Després, el programa d'OCR llig la pàgina, descobreix on són els paràgrafs, les línies i, finalment, els caràcters concrets, i els transforma en un text informatitzat (normalment bastant imperfecte, especialment si és manuscrit).
es_es: Después, el programa de OCR lee la página, descubre donde están los párrafos, las líneas y, finalmente, los caracteres concretos, y los transforma en un texto informatizado (normalmente bastante imperfecto, especialmente si es manuscrito).

source: Per exemple, el document HTML que es mostra en la figura es mostraria en un navegador aproximadament com en la figura .
es_es: Por ejemplo, el documento HTML que se muestra en la figura se mostraría en un navegador aproximadamente como en la figura .

source: Unicode té 31 bits; és a dir, permet $2^{31
es_es: Unicode tiene 31 bits; es decir, permite $2^{31

source: {} un full d'estil.
es_es: {} una hoja de estilo.

source: De fet, recentment, amb l'aparició de XML (vegeu l'apartat ), s'observa una tendència cap a l'adopció de formats de document estructurats, és a dir, no relacionats únicament amb la presentació, sinó també amb l'estructura pròpia del document, formats normalment concebuts de manera que la presentació desitjada es puga produir a partir de l'estructura usant fitxers (anomenats fulls d'estil) amb regles d'estil ben definides (vegeu la secció ).
es_es: De hecho, recientemente, con la aparición de XML (ved el apartado ), se observa una tendencia hacia la adopción de formatos de documento estructurados, es decir, no relacionados únicamente con la presentación, sino también con la estructura propia del documento, formatos normalmente concebidos de forma que la presentación deseada se pueda producir a partir de la estructura usando ficheros (llamadas hojas de estilo) con reglas de estilo muy definidas (veáis la sección ).

source: El processament de textos també s'anomena tractament de textos (paral·le­la­ment al francés, traitement textes).
es_es: El procesamiento de textos también se denomina tratamiento de textos (paralelamente al francés, traitement textes).

source: segons l'estat emocional del parlant, etc.
es_es: según el estado emocional del hablante, etc.

source: } } {El document HTML de la figura , vist a través d'un navegador determinat.}
es_es: } } {El documento HTML de la figura , visto a través de un navegador determinado.}

source: D'acord amb la categoria lèxica del mot anterior Usant la semàntica dels mots Usant un model estadístic de grups de dos mots en català
es_es: De acuerdo con la categoría léxica de la palabra anterior Usando la semántica de las palabras Usando un modelo estadístico de grupos de dos palabras en catalán

source: En la llengua d'origen és costum posar en cursives tant els mots estrangers (``Sprachgefühl'') com els termes quan es defineixen per primera volta (``Un octet és...''), se sagna la primera línia de tots els paràgrafs, i els números de secció porten un punt al final (``1.1.
es_es: En la lengua de origen es costumbre poner en cursivas tanto las palabras extranjeras (``Sprachgefühl'') como los términos cuando se definen por primera vez (``Un octeto es...''), se sangra la primera línea de todos los párrafos, y los números de sección llevan un punto al final (``1.1.

source: De fet, el significat de les etiquetes (és a dir, quines conseqüències tindran quan es processe el document XML) l'ha d'establir el programa o els programes que processaran els documents.
es_es: De hecho, el significado de las etiquetas (es decir, qué consecuencias tendrán cuando se procese el documento XML) lo tiene que establecer el programa o los programas que procesarán los documentos.

source: Quina n'és la causa?
es_es: ¿Cuál es la causa?

source: {}més grans que 256.
es_es: {}más grandes que 256.

source: full d'estil XSL
es_es: hoja de estilo XSL

source: Un format obert per a intercanviar documents de text entre processadors de textos.
es_es: Un formato abierto para intercambiar documentos de texto entre procesadores de textos.

source: Per a la presentació de documents XML, existeix un llenguatge de programació de fulls d'estil molt més potent que CSS anomenat XSL.} (extended stylesheet language) que permet transformar un document XML (amb etiquetes que n'indiquen l'estructura del contingut) en un altre document XML, HTML o de qualsevol altre format (Postscript, PDF, RTF, etc.), per exemple, per a presentar-lo visualment (veure figura ).
es_es: Para la presentación de documentos XML, existe un lenguaje de programación de hojas de estilo mucho más potente que CSS llamado XSL.} (extended stylesheet language) que permite transformar un documento XML (con etiquetas que indican la estructura del contenido) en otro documento XML, HTML o de cualquiera otro formato (Postscript, PDF, RTF, etc.), por ejemplo, para presentarlo visualmente (ver figura ).

source: La presentació de documents en aquests mitjans té problemes similars.
es_es: La presentación de documentos en estos medios tiene problemas similares.

source: No, perquè la forma de les lletres no depén de la llengua, ja que s'usen tipus de lletra comuns.
es_es: No, porque la forma de las letras no depende de la lengua, puesto que se usan tipo de letra comunes.

source: Més informació en {http://www.w3c.org/Style/XSL/
es_es: Más información en {http://www.w3c.org/style/xsl/

source: Tecnologies auxiliars per a la generació de textos
es_es: Tecnologías auxiliares para la generación de textos

source: No n'hi ha, cal un diccionari.
es_es: No hay, hace falta un diccionario.

source: Veiem bé totes les lletres excepte les accentuades, les que porten dièresi, la ñ o la ç: en el seu lloc apareixen altres símbols o lletres típiques de les llengües d'Europa de l'Est.
es_es: Vemos bien todas las letras excepto las acentuadas, las que traen diéresis, la ñ o la ç : en su lugar aparecen otros símbolos o letras típicas de las lenguas de Europa del Este.

source: <!ELEMENT NOM (#PCDATA)> <!ELEMENT NUM (#PCDATA)> <!ELEMENT DATA (#PCDATA)> El TEXT es compon d'un o més (+) paràgrafs (P).
es_es: <!ELEMENT NOM (#PCDATA)> <!ELEMENT NUM (#PCDATA)> <!ELEMENT DATA (#PCDATA)> El TEXTO se compone de uno o más (+) párrafos (P).

source: Una pantalla en blanc.
es_es: Una pantalla en blanco.

source: Els valors dels atributs han d'anar entre cometes dobles ("valor") o simples ('valor').
es_es: Los valores de los atributos tienen que ir entre comillas dobles ("valor") o simples ('valor').

source: El navegador decideix com dividir-lo en línies per a presentar-lo.
es_es: El navegador decide cómo dividirlo en líneas para presentarlo.

source: {Presentació de documents XML i HTML amb fulls d'estil CSS.}
es_es: {Presentación de documentos XML y HTML con hojas de estilo CSS.}

source: Depén del format del text (HTML, etc.) Els mateixos que en la codificació ASCII Els que tenien en la codificació ASCII més 128.
es_es: Depende del formato del texto (HTML, etc.) Los mismos que en la codificación ASCII Los que tenían en la codificación ASCII más 128.

source: Una altra aplicació de les DTD és fer-les servir per a facilitar l'edició de documents XML vàlids: un editor de documents XML pot consultar la DTD per suggerir a la persona usuària l'element o elements correctes en el context actual, o per emetre un missatge d'error tan aviat com el document perda la seua validesa.
es_es: Otra aplicación de las DTD es usarlas para facilitar la edición de documentos XML válidos: un editor de documentos XML puede consultar la DTD para sugerir a la persona usuaria el elemento o elementos correctos en el contexto actual, o para emitir un mensaje de error tan pronto como el documento pierda su validez.

source: NUL (caràcter nul)
es_es: NULO (carácter nulo)

source: De fet, les persones que fan això reforcen, involuntàriament, la posició monopolística de Microsoft en el mercat del programari per a ordinadors personals.
es_es: De hecho, las personas que hacen esto refuerzan, involuntariamente, la posición monopolística de Microsoft en el mercado del software para ordenadores personales.

source: {Obtenció de tres presentacions diferents d'un únic document XML mitjançant fulls d'estil.}
es_es: {Obtención de tres presentaciones diferentes de un único documento XML mediante hojas de estilo.}

source: Tot i que ampliem l'ASCII a ANSI o Unicode, encara és molt limitat.
es_es: A pesar de que ampliamos el ASCII a ANSI o Unicode, todavía es muy limitado.

source: <!ELEMENT TEXT (P)+> Finalment, els paràgrafs contenen text.
es_es: <!ELEMENT TEXT (P)+> Finalmente, los párrafos contienen texto.

source: {} si només usa les marques vàlides dels documents HTML.
es_es: {} si sólo usa las marcas válidas de los documentos HTML.

source: (en anglés, aquest concepte de fidelitat visual es resumeix amb el mot { wysiwyg}, fet amb les sigles de ``what you see is what you get'', és a dir, ``el que veieu és el que obtindreu''); la secció descriu alguns problemes derivats d'aquesta tendència.
es_es: (en inglés, este concepto de fidelidad visual se resume con la palabra { wysiwyg}, hecho con las siglas de ``what you see is what you get'', es decir, ``lo que veis es lo que obtendréis''); la sección describe algunos problemas derivados de esta tendencia.

source: i poc freqüents en textos usuals
es_es: y poco frecuentes en textos usuales

source: { Un altre encapçalament de nivell 2}
es_es: { Otro encabezamiento de nivel 2}

source: Tots aquests formats usen combinacions especials de caràcters de text per a indicar aquestes característiques d'estructuració o de presentació. D'altra banda, hi ha els formats particulars dels processadors de textos comercials com ara Corel WordPerfect o Microsoft Word, que usen esquemes diferents, basats en codis binaris no relacionats amb l'ASCII. Com ja s'ha dit, l'ús de formats de text més avançats no només serveix per a determinar-ne la presentació en la pantalla o quan són impresos; com veurem més avall, en el cas de SGML i XML, el format serveix per a estructurar el document de text en unitats directament relacionades amb el contingut del document, com ara seccions, títols de secció, llistes, paràgrafs, etc.; aquesta estructuració interna del document pot ser usada després per a fer recerques d'informació amb l'ajuda de l'estructura definida, com ara buscar un mot concret només en títols de secció, o també per a produir-ne una presentació concreta del document, com veurem més endavant.
es_es: Todos estos formatos usan combinaciones especiales de caracteres de texto para indicar estas características de estructuración o de presentación. Por otro lado, están los formatos particulares de los procesadores de textos comerciales, como por ejemplo Corel WordPerfect o Microsoft Word, que usan esquemas diferentes, basados en códigos binarios no relacionados con el ASCII. Como ya se ha dicho, el uso de formatos de texto más avanzados no sólo sirve para determinar la presentación en la pantalla o cuando son imprimidos; como veremos más abajo, en el caso de SGML y XML, el formato sirve para estructurar el documento de texto en unidades directamente relacionadas con el contenido del documento, como en secciones, títulos de sección, listas, párrafos, etc.; esta estructuración interna del documento puede ser usada después para hacer investigaciones de información con la ayuda de la estructura definida, como por ejemplo buscar una palabra concreta sólo en títulos de sección, o también para producir una presentación concreta del documento, como veremos más adelante.

source: Hi ha sistemes de reconeixement { independents del parlant} i sistemes dependents del parlant (els últims normalment han de ser entrenats per la persona abans de l'ús).
es_es: Hay sistemas de reconocimiento { independientes del hablante} y sistemas dependientes del hablante (los últimos normalmente tienen que ser entrenados por la persona antes del uso).

source: Per exemple, XML és especialment popular com a eina per a definir l'estructura dels documents presents en les biblioteques digitals.
es_es: Por ejemplo, XML es especialmente popular como herramienta para definir la estructura de los documentos presentes en las bibliotecas digitales.

source: Recordeu que en informàtica és comú comptar començant pel zero.
es_es: Recordad que en informática es común contar empezando por el cero.

source: Quants octets (bytes) ocupa?
es_es: ¿Cuántos octetos (bytes) ocupa?

source: <?xml version="1.0" encoding="ISO-8859-1"?> <!-- Aquest és l'exemple de DTD de FAX --> <!ELEMENT FAX (DESTINATARI, REMITENT?, DATA, TEXT)> <!ELEMENT DESTINATARI (NOM?, NUM)> <!ELEMENT REMITENT (NOM?, NUM)> <!ELEMENT NOM (#PCDATA)> <!ELEMENT NUM (#PCDATA)> <!ELEMENT DATA (#PCDATA)> <!ELEMENT TEXT (P)+> <!ELEMENT P (#PCDATA)> {La DTD que defineix els faxos com el de la fig. .}
es_es: <?xml version="1.0" encoding="ISO-8859-1"?> <!-- Aquest és l'exemple de DTD de FAX --> <!ELEMENT FAX (DESTINATARI, REMITENT?, DATA, TEXT)> <!ELEMENT DESTINATARI (NOM?, NUM)> <!ELEMENT REMITENT (NOM?, NUM)> <!ELEMENT NOM (#PCDATA)> <!ELEMENT NUM (#PCDATA)> <!ELEMENT DATA (#PCDATA)> <!ELEMENT TEXT (P)+> <!ELEMENT P (#PCDATA)> {La DTD que define los faxes como el de la fig. .}

source: En canvi, el RAP per a un propòsit específic (per exemple, la consulta telefònica d'horaris de trens o de les condicions del trànsit) està molt més avançat.
es_es: En cambio, el RAH para un propósito específico (por ejemplo, la consulta telefónica de horarios de trenes o de las condiciones del tránsito) está mucho más avanzado.

source: La tendència actual afavoreix que el text es mostre tan paregut com siga possible a la versió impresa que se'n produirà, quant a format, tipus de lletra, etc.
es_es: La tendencia actual favorece a que el texto se muestre tan semejante como sea posible a la versión impresa que se producirá, en cuanto a formato, tipo de letra, etc.

source: Els documents HTML comencen idealment amb la marca ``<html>'' i acaben amb la marca ``</html>'', i tenen, entre altres elements, un títol (``<title></title>'') i un cos (``<body></body>'').
es_es: Los documentos HTML empiezan idealmente con la marca ``<html>'' y acaban con la marca ``</html>'', y tienen, entre otros elementos, un título (``<title></title>'') y un cuerpo (``<body></body>'').

source: De fet, existeix una DTD SGML (i la DTD XML simplificada corresponent) per a codificar documents de text de l'estil dels llibres, els articles, etc., que s'anomena TEI, de l'anglés text encoding initiative, ``iniciativa de codificació de textos'' ({http://www.tei-c.org
es_es: De hecho, existe una DTD SGML (y la DTD XML simplificada correspondiente) para codificar documentos de texto del estilo de los libros, los artículos, etc., que se denomina TEI, del inglés text encoding initiative, ``iniciativa de codificación de textos'' ({http://www.tei-c.org

source: Per a guardar aquesta informació, s'usen: D'una banda, codificacions o formats basats en text (ANSI, Unicode, etc.) com ara SGML (standardized generalized markup language), la seua versió simplificada XML (extensible markup language), el tipus SGML anomenat HTML (hypertext markup language), el format proposat per Microsoft anomenat RTF (rich text format, no relacionat amb SGML), o el llenguatge per a impressores anomenat Postscript.
es_es: Para guardar esta información, se usan: Por un lado, codificaciones o formatos basados en texto (ANSI, Unicode, etc.) como por ejemplo SGML (standardized generalized markup language), su versión simplificada XML (extensible markup language), el tipo SGML llamado HTML (hypertext markup language), el formato propuesto por Microsoft llamado RTF (rich texto formado, no relacionado con SGML), o el lenguaje para impresoras denominado Postscript.

source: No s'ha de dir justificat a la dreta: la justificació és sempre als dos marges alhora; el que s'ha de dir en aquest cas és alineat a la dreta.
es_es: No se tiene que decir justificado a la derecha: la justificación es siempre a los dos márgenes a la vez; lo que se tiene que decir en este caso es alineado a la derecha.

source: En HTML, les marques tenen un significat determinat.
es_es: En HTML, las marcas tienen un significado determinado.

source: Considereu aquest doblet anglés clàssic sobre el tema: people can easily recognize speech no és molt diferent de { people can easily wreck a nice beach.
es_es: Considerad este doblete inglés clásico sobre el tema: people can easily recognize speech no es muy diferente de people { can easily wreck a nice beach.

source: CR (retorn del carro)
es_es: CR (regreso del carro)

source: full d'estil CSS
es_es: hoja de estilo CSS

source: Ajuda conéixer en quina llengua estan escrits?
es_es: ¿Ayuda conocer en qué lengua están escritos?

source: {}entre 0 i 127.
es_es: {}entre 0 y 127.

source: Els comentaris comencen amb +<!--+ i acaben amb +-->+ i es poden situar en qualsevol part d'una DTD.
es_es: Los comentarios empiezan con +<!--+ y acaban con +-->+ y se pueden situar en cualquier parte de una DTD.

source: {Reconeixement automàtic de textos escrits}
es_es: {Reconocimiento automático de textos escritos}

source: La versió de XML.
es_es: La versión de XML.

source: Com es pot veure, aquestes regles que defineixen un document XML ben format no diuen quines etiquetes són vàlides i quines no, o quins atributs pot tenir un determinat element, o quins elements poden anar dins de un determinat element, en quin ordre o en quina quantitat.
es_es: Como se puede ver, estas reglas que definen un documento XML bien formado no dicen qué etiquetas son válidas y cuales no, o qué atributos puede tener un determinado elemento, o qué elementos pueden ir dentro de un determinado elemento, en qué orden o en qué cantidad.

source: RTF (rich text format, és a dir, format de text ric) és un format impulsat per l'empresa Microsoft per a facilitar l'intercanvi de documents entre processadors de textos mantenint-ne el format.
es_es: RTF (rich text format, es decir, formado de texto rico) es un formato impulsado por la empresa Microsoft para facilitar el intercambio de documentos entre procesadores de textos manteniendo el formato.

source: El document pot contenir comentaris entre <!-- i --> o instruccions de processament del tipus <?nom?> en qualsevol lloc excepte dins de les etiquetes.
es_es: El documento puede contener comentarios entre <!-- i --> o instrucciones de procesamiento del tipo <?nombre?> en cualquier lugar excepto dentro de las etiquetas.

source: {Unicode} Els codis de 8 bits com ANSI són adequats per a la major part de les llengües europees, les quals es basen en l'alfabet llatí amb algunes modificacions, però hi ha llengües al món que tenen sistemes d'escriptura molt complexos amb milers de símbols diferents, com ara el xinés o el japonés.
es_es: {Unicode} Los códigos de 8 bits como ANSI son adecuados para la mayor parte de las lenguas europeas, las cuales se basan en el alfabeto latino con algunas modificaciones, pero hay lenguas en el mundo que tienen sistemas de escritura muy complejos con miles de símbolos diferentes, como por ejemplo el chino o el japonés.

source: Aquests caràcters que indiquen el format són normalment invisibles per a la persona usuària mentre redacta o veu el document, excepte si demana explícitament que els vol veure.
es_es: Estos caracteres que indican el formato son normalmente invisibles para la persona usuaria mientras redacta o ve el documento, excepto si pide explícitamente que los quiere ver.

source: Amb un o més fulls d'estil.
es_es: Con una o más hojas de estilo.

source: Aquest format ha estat impulsat per l'empresa Adobe, que ofereix un programa gratuït ---l'Acrobat Reader; a més, també es pot usar els programes gratuïts de codi obert GhostScript i Ghostview ({http://www.cs.wisc.edu/ ghost/}).}--- per visualitzar els documents; per crear-los podem usar programes especialitzats o qualsevol processador de textos que permeta exportar (realment imprimir) el nostre document a PDF.
es_es: Este formato ha sido impulsado por la empresa Adobo, que ofrece un programa gratuito ---el Acrobat Reader; además, también se pueden usar los programas gratuitos de código abierto GhostScript y Ghostview ({http://www.cs.wisc.edu/ ghost/}).}--- para visualizar los documentos; para crearlos podemos usar programas especializados o cualquier procesador de textos que permita exportar (realmente imprimir) nuestro documento a PDF.

source: |<cv><nom>Pere</nom><ob>Escrits</ob></cv>|
es_es: |<cv><nom>Pere</nom><ob>Escritos</ob></cv>|

source: eixir del processador de textos.
es_es: Práctica 2: Uso del procesador de textos
